In [3]:
set1 = {1,2,3}

In [4]:
set2={2,3,4}

In [5]:
set1.difference(set2)

{1}

In [7]:
set2-set1

{4}

In [8]:
tu=(1,2,3,[1,2])

In [12]:
tu[3]=4

TypeError: 'tuple' object does not support item assignment

In [14]:
import pandas as pd

x=pd.DataFrame({'x':[1,2,3],'x':[3,2,1]})

In [15]:
x

   x
0  3
1  2
2  1

In [16]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [17]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [18]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [21]:
pd.concat([df1, df2], axis=1)

  employee        group employee  hire_date
0      Bob   Accounting     Lisa       2004
1     Jake  Engineering      Bob       2008
2     Lisa  Engineering     Jake       2012
3      Sue           HR      Sue       2014